Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionNormalColored
Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionColored
Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPositionNormal
Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.GetVertexStreamPosition
Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexBuffer.Map(System.Int32)
Maps a portion of the buffer into memory, so that vertex data can be written into it (see Autodesk::Revit::DB::DirectContext3D::VertexStream).
sizeInFloats:
The size of the part of the buffer to be mapped, measured in floats.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
-or-
Thrown if the buffer is smaller than sizeInFloats.
Since:
2017